{"link_name": "OpenVPN automatic discovery of all service instances on the server.", "type": "Template", "OS": "", "vendor": "Others", "minZabbVer": "3.4.x", "link_desc": "<p>A template that allows you to automatically detect all OpenVpn instances running on the server.</p>\n<p>This template works for OpenVPN servers configured to work with a certificate.</p>\n<p> </p>\n<p>Opportunities:</p>\n<p>1) The \"OpenVPN Server - All Servers\" template automatically detects the number of OpenVPN instances based on configuration files (/etc/openvpn/*.conf)</p>\n<p>2) Dynamically creates for each detected configuration a host in the \"OpenVPN-All-services\" group and applies the \"Dynamic Add OpenVPN - Services\" autodiscover template to it.</p>\n<p>Dynamic host names are the names of the configuration files.</p>\n<p>3) Dynamically created hosts automatically detect all configured keys for each instance of OpenVPN and create metrics for them of the used traffic and the status of client connection to the server. Adds graphics.</p>\n<p> </p>\n<p>Installation:</p>\n<p>There are 3 files in the archive:</p>\n<p>1) Template for import - zbx_templates_openvpn-all.xml</p>\n<p>2) Zabbix agent configuration file - open_vpn_all_admin.conf</p>\n<p>3) The script for obtaining the necessary data - discover_vpn_all_admin.sh</p>\n<p> </p>\n<p>On the server with OpenVPN install zabbiks agent. After installation, you need to copy the files in the following way:</p>\n<p>1) open_vpn_all_admin.conf -> /etc/zabbix/zabbix_agentd.d</p>\n<p>2) discover_vpn_all_admin.sh -> / etc / zabbix / scripts (perhaps the scripts directory will have to be created). The file must be given executable rights to the zabbix user.</p>\n<p>If the script file will be located in another place, then you need to fix the path to the new location of the script in the file open_vpn_all_admin.conf</p>\n<p>3) Restart the zabbix agent for the change to take effect.</p>\n<p> </p>\n<p>How to use:</p>\n<p>Create a host and specify a template for it: OpenVPN Server - All Servers and ip or hostname for the zabbiks agent.</p>\n<p>Expect the dynamic generation of all necessary data.</p>\n<p>Detection speed 1 hour. You can change this in the batch settings to speed up the process.</p>\n<p> </p>\n<p>Requirements for the structure of OpenVPN duplicates:</p>\n<p> </p>\n<p>1) All copies / configurations (* .conf) must be in the default directory: / etc / openvpn</p>\n<p>If the path will be redirected, then it must be specified in the discover_vpn_all_admin.sh file the value of the variable: DIR =</p>\n<p> </p>\n<p>2) It is necessary to give the right to read the log files of each discovered instance of the OpenVPN server to ensure the possibility of obtaining data.</p>\n<p> </p>\n<p>Zabbix server requirements:</p>\n<p>The template is written and tested on version Zabbix 3.4.6</p>\n<p>But I think he will work on new versions.</p>\n<p> </p>\n<p>I tried to write the most detailed instructions. But if you have any questions, write them in the comments. I or other colleagues will help solve the problem.</p>\n<p> </p>\n<p>P.S.</p>\n<p>Special thanks to Alexander Lesavoy for his help in writing the", "features": "Zabbix Agent", "address": "", "city": "", "state": "", "country": "", "postcode": "", "telephone": "", "fax": "", "email": "", "website": "", "price": 0, "link_hits": 2842, "link_votes": null, "link_rating": 0, "link_featured": null, "link_created": "2020-01-20 11:49:18", "link_modified": "0000-00-00 00:00:00", "link_visited": null, "publish_up": "2020-01-20 11:49:18", "publish_down": "0000-00-00 00:00:00", "metakey": "", "metadesc": "", "1.8": "", "2.0": "", "2.2": "", "2.4": "", "3.0": "", "3.2": "", "3.4": "Zabbix_OpenVPN-all_Services.zip", "4.0": "", "4.2": "", "4.4": "", "5.0": "", "5.2": "", "tags": "", "author": "Evgeniy Ivanov", "user_id": 11289, "link_id": 1925, "cat_id": "124", "internal_notes": "", "lat": 0, "lng": 0, "zoom": ""}