{"link_name": "Meraki Dashboard Polling", "type": "Template", "OS": "", "vendor": "Others", "minZabbVer": "4.4.x", "link_desc": "<p>This is a Zabbix template to poll meraki dashboard via SNMP.  I made this because I really needed access point numbers and the number of connected clients for a Grafana dashboard for a multi vendor enterprise. So this is that v1.0.  For me, I count the items for the number of APs and then sum the numbers for the client count.</p>\n<p>This requires you to enable SNMPv2 polling in your Meraki Dashboard and set the host to monitor snmp.meraki.com port 16100 and the global macro {$SNMP_COMMUNITY} to whatever Meraki Dashboard gives you.  This only uses OID's so no need to put the MIB file anywhere.  You MAY need to increase the SNMP poller timeout in Zabbix because snmp.meraki.com tends to be pretty slow at returning SNMP requests.  I have mine set to 30 seconds and it works well so far.</p>\n<p>I am working on getting more data into this, including (hopefully) interface statistics for MR and MX, I would also LOVE to get the number of clients connected to each radio (2.4 and 5) like I do from other venders but I will need to see if Meraki gives up that data.</p>", "features": "SNMP Agent", "address": "", "city": "", "state": "", "country": "", "postcode": "", "telephone": "", "fax": "", "email": "", "website": "", "price": 0, "link_hits": 7530, "link_votes": 1, "link_rating": 5, "link_featured": null, "link_created": "2020-04-30 19:42:45", "link_modified": "2020-04-30 21:15:44", "link_visited": null, "publish_up": "2020-04-30 19:42:45", "publish_down": "0000-00-00 00:00:00", "metakey": "", "metadesc": "", "1.8": "", "2.0": "", "2.2": "", "2.4": "", "3.0": "", "3.2": "", "3.4": "", "4.0": "", "4.2": "", "4.4": "zbx_MerakiDashboard_1.0_templates.xml", "5.0": "", "5.2": "", "tags": "Meraki, Meraki Dashboard, Meraki AP, Meraki SSID", "author": "John T. Young", "user_id": 11741, "link_id": 2074, "cat_id": "116", "internal_notes": "", "lat": 0, "lng": 0, "zoom": ""}