{
    "link_name": "SDelete utility",
    "type": "Template",
    "OS": "",
    "vendor": "Others",
    "minZabbVer": "3.4.x",
    "link_desc": "<p>Template for monitoring working of SDelete utility.<br />Custom-made, maybe will be useful/interesting for somebody. Made for own purposes, published here only \"as is\", no future modernization planned.<br />About SDelete, what is this and how it works: https://docs.microsoft.com/en-us/sysinternals/downloads/sdelete<br />Template provides for SDelete usage on Windows virtual machines in \"-z\" mode: \"Zero free space (good for virtual disk optimization)\". Best result is on client Windows machines (tested on Windows 7, Windows 8.1), usage on Windows Servers can be if this is justify for some reasons. \"Zero free space\" is very helpful for backups of VMs by Snapshot method - tested (and made) on Proxmox. After running \"sdelete -z C:\" size of backup file decrease on 10+ Gb.<br /><br />How to install:<br />- download and unpack archive. Contains SDelete 64 bit version 2.02 (latest for moment of publishing). Download from official site and replace with latest version available.<br />- copy \"SDelete\" folder to root of C drive<br />- Zabbix agent must be installed on this machine in C:\\Zabbix\\bin\\win64\\. If you have other directory - please, make changes to file SDelete.ps1.<br />- edit file SDelete.ps1 - in string \"C:\\Zabbix\\bin\\win64\\zabbix_sender.exe -z 127.0.0.1 -p 10051 -s $hostname -k sdelete -o $zabbix_result\" instead of 127.0.0.1 put your Zabbix server address<br />- make sure that your file C:\\Zabbix\\conf\\zabbix_agentd.win.conf has correct preferences, as PowerShell script will get hostname from this file. Otherwise, you will have miss-configuration and template will not work.<br />- on target Windows machine open Task Scheduler and create SDelete task here. Run it as SYSTEM account with highest privileges. Period - as you wish, by default meaning once per week. Set \"Actions\" - Start a program C:\\SDelete\\SDelete.cmd<br />Other parameters - at your discretion. Keep on mind that execution time of SDelete can be several hours. It's individual, that's why I don't offer any values.<br />- make test run from Task Scheduler to be sure that everything is ok. If SDelete utility will run normally - log file in C:\\SDelete\\SDeleteC.log must occurs. Stop task if you don't want to wait for finish. If log file was not occurred - something goes wrong.<br />- import Template to Zabbix server. It's working on Zabbix trapper logic - nothing to poll, just wait for data. Apply Template to target host. Change macros \"{$PERIOD}\". Value must be as your period from Task Scheduler +1 day. For example, if you are running SDelete script weekly - leave it \"8d\" as provided; if monthly - put \"32d\". This is needed for \"NODATA\" trigger that will inform you in case of some troubles if something fails and script was not run.<br />- in case of getting \"error\" - manually check C:\\SDelete\\SDelete[C,D...].log<br /><br />That's it. For my purpose everything is fine.<br />Thanks for attention!</p>",
    "features": "Zabbix Agent|Zabbix Trapper|Custom Script",
    "address": "",
    "city": "",
    "state": "",
    "country": "",
    "postcode": "",
    "telephone": "",
    "fax": "",
    "email": "",
    "website": "",
    "price": 0,
    "link_hits": 1293,
    "link_votes": null,
    "link_rating": 0,
    "link_featured": null,
    "link_created": "2019-04-21 17:53:21",
    "link_modified": "2019-04-21 20:47:29",
    "link_visited": null,
    "publish_up": "2019-04-21 17:53:21",
    "publish_down": "0000-00-00 00:00:00",
    "metakey": "",
    "metadesc": "",
    "1.8": "",
    "2.0": "",
    "2.2": "",
    "2.4": "",
    "3.0": "",
    "3.2": "",
    "3.4": "SDelete.zip",
    "4.0": "",
    "4.2": "",
    "4.4": "",
    "5.0": "",
    "5.2": "",
    "tags": "Proxmox, SDelete, Windows client",
    "author": "MR_Andrew",
    "user_id": 2057,
    "link_id": 1606,
    "cat_id": "124",
    "internal_notes": "",
    "lat": 0,
    "lng": 0,
    "zoom": ""
}