{"link_name": "Sonicwall Gen6plus", "type": "Template", "OS": "", "vendor": "Others", "minZabbVer": "4.4.x", "link_desc": "<p><i>NOTA:versión mejorada 19-01-2021, Mejoras y arreglos. varios.</i></p>\n<p><strong>Plantilla para Firewalls Sonicwall Gen6 en adelante, 6.2.x, 6.5.x.<br /></strong><em>Probado en TZ400. TZ500, TZ600, NA2600. (v6.5 todos) </em><strong>Zabbix V5.2</strong></p>\n<p>El resto de plantillas publicadas aquí, me ayudaron a aprender y crear esta, mis agradecimientos a los autores.</p>\n<p><strong>Características:<br /></strong>Para Protocolo SNMP, en solicitudes y en Traps.</p>\n<p>Toda en Español. (lo que sale en Ingles es porque se inyecta de Zabbix, o lo heredo de los MIBs de Sonicwall)</p>\n<p>Detección de interfaz físico caído y recuperación, (se ha de des habilitar los que no están en uso) Nota:Sonicwall informa entre 3 estados, 1 arriba, 2 caído, 3 desconocido.(Interfaces definidos en la plantilla 10)</p>\n<p>Hereda Graficas y Alertas de otras plantillas que me parecieron interesantes, como Latencia, Perdida de paquetes, etc.<br />Graficas de trafico en la interfaces Fisicas, Ram Usada, y Conexiones concurrentes Estas dos ultimas con Disparo de alertas y recuperación.</p>\n<ul>\n<li><strong>Destacados:<br /></strong><strong>En los nuevos Firmwares Gen6.</strong></li>\n</ul>\n<p>Se ayuda de los nuevos OIDs, para la detección precisa del uso de los Cores. Sonicwall ya tiene implementado 2 nuevos, uno para el ControlPlane (Core 0) (sonicCurrentManagementCPUUtil.0) y otro para el DataPlane (resto de cores) (sonicCurrentFwdAndInspectCPUUtil.0) Este ultimo  es el encargado del análisis de los paquetes en los distintos servicios de seguridad, y funcionalidades.<br />Alertas y recuperación incluidas.</p>\n<ul>\n<li><strong>Aplicación de Información para cumplimentar el inventario. </strong>He añadido 10 entradas que aportan sus datos para rellenar el inventario con información relevante. </li>\n</ul>\n<ul>\n<li><strong> Taps </strong>Se han añadido 10 tipos distintos de avisos la mayoria con recuperación ante eventos como FailOver, Reinicio por Software, Servicios de Seguriad, NetworkMonitor,AppControl, etc.</li>\n<li>Sonicpoints Estado y nombres. (DLL)</li>\n</ul>\n<p><b>Con especial incapie a las caídas y </b><b>recuperaciones</b><b> de los túneles, tanto en el modo Tunel interface como S2S</b></p>\n<ul>\n<li><strong>Auto descubrimiento </strong>Tanto las VLans como los tuneles la captación del computo del trafico se hace de forma automática, lo ideal es crear las gráficas a mano de los \"Items\" creados automáticamente. </li>\n</ul>\n<p><em>Esto se produce al crear Ids distintos cada vez que un tunel se cae o renegocia, esto es una pesadilla, de hacer a mano, lo ideal es el modo de autodescubrimiento y tirar de variables.</em></p>\n<p><strong>snmpwalk. (Debian) </strong>Lo use para lanzar consultas comprobar resultados, indagar en otros OIDS, esencial.<br /><b>ManageEngine MibBrowser (Windows) </b>Carga de los MIBs de Traps y saber que es para que y etiquetar.</p>\n<p><i>NOTA:versión mejorada 19-01-2021, Mejoras y arreglos. varios.</i></p>", "features": "SNMP Agent|SNMP Trapper", "address": "", "city": "", "state": "", "country": "", "postcode": "", "telephone": "", "fax": "", "email": "", "website": "", "price": 0, "link_hits": 1415, "link_votes": null, "link_rating": 0, "link_featured": null, "link_created": "2020-12-22 10:03:48", "link_modified": "2021-01-19 10:17:50", "link_visited": null, "publish_up": "2020-12-22 10:03:48", "publish_down": "0000-00-00 00:00:00", "metakey": "", "metadesc": "", "1.8": "", "2.0": "", "2.2": "", "2.4": "", "3.0": "", "3.2": "", "3.4": "", "4.0": "", "4.2": "", "4.4": "", "5.0": "zbx_export_templatesv2.0.xml", "5.2": "", "tags": "Sonicwall, Gen6, SNMP, MIBs, Español, Spanish, Alertas", "author": "LocalRed", "user_id": 12815, "link_id": 2283, "cat_id": "221,407", "internal_notes": "", "lat": 0, "lng": 0, "zoom": ""}