{
    "link_name": "Ubiquiti LTU-rocket wireless",
    "type": "Template",
    "OS": "",
    "vendor": "UBIQUITI",
    "minZabbVer": "4.4.x",
    "link_desc": "<p>Zabbix version 5.<br /><br />SNMPv2<br /><br />Items for AP: Wireless Role, Wireless channel bandwidth, Tx power EIRP, Tx modulation, The percentage of total memory usage, The percentage of total CPU usage, The main frequency to use, The MAC address of this device, The list of alternative frequencies, The firmware version running, The device name, The device model, Radio SSID, Radio connected, Packet per second for tx, Packet per second for rx, GPS status, GPS Satellites Visible, GPS Satellites Tracked, GPS Longitude, GPS Latitude, GPS Horizontal Dilution of Precision, GPS Fix Obtained, GPS Altitude (m), GPS Altitude (ft), Ethernet packet per second for tx, Ethernet packet per second for rx, Ethernet Data port plugged, Cable loss, Automatic Tx modulation selection, Antenna gain.<br /><br />Items for CPE discovery: Device Model, Device Name, Distance, Firmware, IdealRxPower0 (ap), IdealRxPower1 (ap), Last IP address, Latency, Registration Attempts, Rx Capacity, RxIdealPower0 (cpe), RxIdealPower1 (cpe), RxPower0 (ap), RxPower0 (cpe), RxPower1 (ap), RxPower1 (cpe), RxPowerLevel0 (ap), RxPowerLevel0 (cpe), RxPowerLevel1 (ap), RxPowerLevel1 (cpe), RxRate, Tx Capacity, TxPower EIRP (cpe), TxRate.<br /><br /><br />Just data retrieval. Template has no triggers, graphs or screens.</p>",
    "features": "SNMP Agent",
    "address": "",
    "city": "",
    "state": "",
    "country": "",
    "postcode": "",
    "telephone": "",
    "fax": "",
    "email": "",
    "website": "",
    "price": 0,
    "link_hits": 1047,
    "link_votes": null,
    "link_rating": 0,
    "link_featured": null,
    "link_created": "2021-01-25 17:18:55",
    "link_modified": "0000-00-00 00:00:00",
    "link_visited": null,
    "publish_up": "2021-01-25 17:18:55",
    "publish_down": "0000-00-00 00:00:00",
    "metakey": "",
    "metadesc": "",
    "1.8": "",
    "2.0": "",
    "2.2": "",
    "2.4": "",
    "3.0": "",
    "3.2": "",
    "3.4": "",
    "4.0": "",
    "4.2": "",
    "4.4": "",
    "5.0": "Ubiquiti LTU-rocket wireless.xml",
    "5.2": "",
    "tags": "",
    "author": "Kari Karvonen",
    "user_id": 5974,
    "link_id": 2311,
    "cat_id": "214",
    "internal_notes": "",
    "lat": 0,
    "lng": 0,
    "zoom": ""
}